# Brewfile - Homebrew dependency management
# Run: brew bundle install

# Core development tools
brew "git"
brew "gh"
brew "jq"
brew "mise"
brew "python"
brew "tmux"
brew "overmind"
brew "neovim"
brew "tree" 
brew "yq"

# Fonts
brew "font-jetbrains-mono-nerd-font"

# Applications
cask "ghostty"
cask "jetbrains-toolbox"
cask "temurin"
cask "visual-studio-code"

# VS Code Extensions
vscode "sourcegraph.amp"
vscode "hverlin.mise-vscode"
vscode "vscjava.vscode-java-pack"
vscode "redhat.java"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.debugpy"
